// 1. Напишите программу, которая на вход принимает два числа и проверяет,
//    является ли первое число квадратом второго.

int num1 = 0;
int num2 = 0;

Console.Write("Please enter the number 1:");
num1 = int.Parse(Console.ReadLine()!);

Console.Write("Please enter the second number");
num2 = int.Parse(Console.ReadLine);
